arc/cf/Catalogs/Ветки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Ветки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантЗапускаТестов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыЗапускаТестов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаТестирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПомещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗапросаНаСлияние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмененияПомещаютсяТолькоЧерезДругиеВетки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЗапускаТестирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиЗапускаТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предшественник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетТестирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетыТестированияВеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРазработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимРазработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрочностьИсправленияОшибок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрочностьИсправленияОшибок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьИзмененияОбъектовМетаданных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

arc/cf/Enums/СтатусыВеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыВеток</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Разрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тестируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Помещена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заморожена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

arc/cf/Enums/ТипыВеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыВеток</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяВеткаПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаВерсии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаТехническогоПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаДляИсправленияОшибок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

arc/cf/Catalogs/Ветки/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отбор = Новый Структура;
	Параметры.Свойство("Отбор", Отбор);
	
	Если Отбор.Свойство("ПометкаУдаления") Тогда
		Отбор.Удалить("ПометкаУдаления");
	КонецЕсли;
	
	Если Параметры.Свойство("Проект") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			   "Владелец",
																			   Параметры.Проект,
																			   ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	Разрабатывается = Истина;
	Тестируется = Истина;
	
	Если Отбор.Свойство("Статус") Тогда

		Если ТипЗнч(Отбор.Статус) = Тип("Массив") 
			ИЛИ ТипЗнч(Отбор.Статус) = Тип("ФиксированныйМассив") Тогда
			МассивСтатусовВеток = Отбор.Статус;
		Иначе
			МассивСтатусовВеток = Новый Массив;
			МассивСтатусовВеток.Добавить(Отбор.Статус);
		КонецЕсли;

		Для Каждого СтатусДляОтбора из МассивСтатусовВеток Цикл
			Если СтатусДляОтбора = Перечисления.СтатусыВеток.Разрабатывается Тогда
				Разрабатывается = Истина;
			ИначеЕсли СтатусДляОтбора = Перечисления.СтатусыВеток.Тестируется Тогда
				Тестируется = Истина;
			ИначеЕсли СтатусДляОтбора = Перечисления.СтатусыВеток.Помещена Тогда
				Помещена = Истина;
			ИначеЕсли СтатусДляОтбора = Перечисления.СтатусыВеток.Заморожена Тогда
				Заморожена = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Отбор.Свойство("Тип") Тогда
		
		Если ТипЗнч(Отбор.Тип) = Тип("Массив")
			ИЛИ ТипЗнч(Отбор.Тип) = Тип("ФиксированныйМассив") Тогда
			МассивТиповВеток = Отбор.Тип;
		Иначе
			МассивТиповВеток = Новый Массив;
			МассивТиповВеток.Добавить(Отбор.Тип);
		КонецЕсли;

		// Установка видимости элементов быстрых отборов по типу в зависимости от отбора
		
		Элементы.ГруппаТипыВеток.Видимость = Истина;
		Если Отбор.Тип = Перечисления.ТипыВеток.ВеткаВерсии
			ИЛИ  Отбор.Тип = Перечисления.ТипыВеток.ОсновнаяВеткаПроекта Тогда
			Элементы.ГруппаТипыВеток.Видимость = Ложь;
		КонецЕсли;

		ИспользоватьОтборПоВеткамВерсии = МассивТиповВеток.Найти(Перечисления.ТипыВеток.ВеткаВерсии) <> Неопределено 
				ИЛИ МассивТиповВеток.Найти(Перечисления.ТипыВеток.ОсновнаяВеткаПроекта) <> Неопределено;
		Элементы.ВеткиВерсии.Видимость = ИспользоватьОтборПоВеткамВерсии;
		ВеткиВерсии = ИспользоватьОтборПоВеткамВерсии;

		ИспользоватьОтборПоВеткамТехническихПроектов =
			МассивТиповВеток.Найти(Перечисления.ТипыВеток.ВеткаТехническогоПроекта) <> Неопределено;
		Элементы.ВеткиТехническихПроектов.Видимость = ИспользоватьОтборПоВеткамТехническихПроектов;
		ВеткиТехническихПроектов = ИспользоватьОтборПоВеткамТехническихПроектов;

		ИспользоватьОтборПоВеткамиДляИсправленияОшибок =
			МассивТиповВеток.Найти(Перечисления.ТипыВеток.ВеткаДляИсправленияОшибок) <> Неопределено;
		Элементы.ВеткиДляИсправленияОшибок.Видимость = ИспользоватьОтборПоВеткамиДляИсправленияОшибок;
		ВеткиДляИсправленияОшибок = ИспользоватьОтборПоВеткамиДляИсправленияОшибок;
	Иначе

		ВеткиВерсии = Истина;
		ВеткиТехническихПроектов = Истина;
		ВеткиДляИсправленияОшибок = Истина;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ИсключитьСсылки") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", 
																			    Параметры.ИсключитьСсылки, 
																			    ВидСравненияКомпоновкиДанных.НеРавно);
	КонецЕсли;
	
	ВеткаДляИсправления = Неопределено;
	Параметры.Свойство("ВеткаДляИсправления", ВеткаДляИсправления);
	Если Параметры.Свойство("ОтбиратьДляИсправленияВОсновнойВетке") 
		И Параметры.ОтбиратьДляИсправленияВОсновнойВетке
		И Параметры.Отбор.Свойство("Владелец") Тогда
		ВеткаДляИсправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Отбор.Владелец, "Ветка");
	КонецЕсли;
	
	Если ВеткаДляИсправления <> Неопределено Тогда
		УстановитьОтборВетокДляИсправления(ВеткаДляИсправления);
	КонецЕсли;
	
	Если Параметры.Свойство("ИсключитьВеткиБезПрямогоПомещения") Тогда
		Если Параметры.ИсключитьВеткиБезПрямогоПомещения Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ИзмененияПомещаютсяТолькоЧерезДругиеВетки", 
																			    Ложь, 
																			    ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановкаОтборовПриОткрытии();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОтветственныйПриИзменении(Элемент)
	УстановитьОтборПоОтветственному();
КонецПроцедуры

&НаКлиенте
Процедура РазрабатываетсяПриИзменении(Элемент)
	УстановитьОтборПоСтатусу();
КонецПроцедуры

&НаКлиенте
Процедура ТестируетсяПриИзменении(Элемент)
	УстановитьОтборПоСтатусу();
КонецПроцедуры

&НаКлиенте
Процедура ПомещенаПриИзменении(Элемент)
	УстановитьОтборПоСтатусу();
КонецПроцедуры

&НаКлиенте
Процедура ЗамороженаПриИзменении(Элемент)
	УстановитьОтборПоСтатусу();
КонецПроцедуры

&НаКлиенте
Процедура ВеткиВерсииПриИзменении(Элемент)
	УстановитьОтборПоТипу();
КонецПроцедуры

&НаКлиенте
Процедура ВеткиТехническихПроектовПриИзменении(Элемент)
	УстановитьОтборПоТипу();
КонецПроцедуры

&НаКлиенте
Процедура ВеткиДляИсправленияОшибокПриИзменении(Элемент)
	УстановитьОтборПоТипу();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановкаОтборовПриОткрытии()
	
	УстановитьОтборПоТипу();
	УстановитьОтборПоСтатусу();
	УстановитьОтборПоОтветственному();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоСтатусу()
	
	ОтборПоСтатусам = Новый Массив;
	Если Заморожена Тогда
		ОтборПоСтатусам.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыВеток.Заморожена"));
	Конецесли;
	Если Разрабатывается Тогда
		ОтборПоСтатусам.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыВеток.Разрабатывается"));
	Конецесли;
	Если Тестируется Тогда
		ОтборПоСтатусам.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыВеток.Тестируется"));
	Конецесли;
	Если Помещена Тогда
		ОтборПоСтатусам.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыВеток.Помещена"));
	Конецесли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Статус",
																			ОтборПоСтатусам,
																			ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры


&НаСервере
Процедура УстановитьОтборПоОтветственному()
	
	ИспользоватьОтбор = ЗначениеЗаполнено(ОтборОтветственный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Ответственный",
																			ОтборОтветственный,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ИспользоватьОтбор);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоТипу()
	
	МассивТипов = Новый Массив;
	Если ВеткиВерсии Тогда
		МассивТипов.Добавить(Перечисления.ТипыВеток.ОсновнаяВеткаПроекта);
		МассивТипов.Добавить(Перечисления.ТипыВеток.ВеткаВерсии);
	КонецЕсли;
	Если ВеткиТехническихПроектов И Элементы.ВеткиТехническихПроектов.Видимость Тогда
		МассивТипов.Добавить(Перечисления.ТипыВеток.ВеткаТехническогоПроекта);
	КонецЕсли;
	Если ВеткиДляИсправленияОшибок И Элементы.ВеткиДляИсправленияОшибок.Видимость Тогда
		МассивТипов.Добавить(Перечисления.ТипыВеток.ВеткаДляИсправленияОшибок);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Тип",
																			МассивТипов,
																			ВидСравненияКомпоновкиДанных.ВСписке);

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборВетокДляИсправления(Ветка)
		
	ГруппаИСтатус = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы,
																			НСтр("ru='Отбор веток по статусу'"),
																			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
																			
	ГруппаИСтатус.Использование = Истина;

	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаИСтатус,
																			НСтр("ru='Отбор веток для исправления'"),
																			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ);
																			
	ГруппаИЛИ.Использование = Истина;
	
	ГруппаИПомещаемаяВетка = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаИЛИ,
																			НСтр("ru='Отбор помещаемых веток'"),
																			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
																			
	ГруппаИПомещаемаяВетка.Использование = Истина;

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ, "Ссылка", ВидСравненияКомпоновкиДанных.Равно, Ветка,,Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИСтатус, "Статус", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.СтатусыВеток.Помещена,,Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИПомещаемаяВетка, "Приемник", ВидСравненияКомпоновкиДанных.Заполнено,,,Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИПомещаемаяВетка, "Приемник", ВидСравненияКомпоновкиДанных.Равно, Ветка,,Истина);
	
	
КонецПроцедуры

#КонецОбласти
